Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7580974424620520821" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151181394507800" -> "1755656464422268000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5235825063027391715" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151182376398000" -> "1755656464551956800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2995981044346890554" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151181607506000" -> "1755656464177583000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8217037801808576046" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151183558597000" -> "1755656465823174000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55" -> (known after apply)
      ~ code_sha256                 = "ItBcwCVdviVbQGWL6Yx+43/3zfs8eMpTjF3sxJL1UpM=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-14T06:02:04.704+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 13260 -> (known after apply)
      ~ version                     = "55" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250814060124462100000005/builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "41184ad271ac5c44bb731791dd128d7f" -> (known after apply)
      ~ id                            = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> (known after apply)
      ~ key                           = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1065876045715158329" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.zip"
          ~ "timestamp" = "1755151181964548200" -> "1755656465153940000"
        }
    }

Plan: 76 to add, 45 to change, 68 to destroy.

Changes to Outputs:
  ~ admin_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=admin@example.com,PASSWORD=Admin@1234! --output json --query AuthenticationResult.IdToken" -> "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=admin@example.com,PASSWORD=Admin1234! --output json --query AuthenticationResult.IdToken"
  ~ guest_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=Guest@Example123! --output json --query AuthenticationResult.IdToken" -> "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=Guest1234! --output json --query AuthenticationResult.IdToken"
module.webgui.null_resource.cloudfront-invalidate: Destroying... [id=1366580970394232522]
module.webgui.null_resource.cloudfront-invalidate: Destruction complete after 0s
module.svep[0].module.lambda-concat.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creating...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creating...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0]: Creation complete after 0s [id=568b37182f27ae0fd1b38a304a9c00062472e652]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0]: Creation complete after 0s [id=592d60e09ce770ab8da0e9b2ce0baba6372aa829]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concat.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Provisioning with 'local-exec'...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creating...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Provisioning with 'local-exec'...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: creating 'builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip' archive
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/concat
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concat.null_resource.archive[0] (local-exec): Created: builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: creating 'builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip' archive
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/security/lambda/sendSecurityAlert
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: inspector.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): Created: builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creation complete after 0s [id=1893705565942804167]
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concat.null_resource.archive[0]: Creation complete after 0s [id=1359686756828472616]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip' archive
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/deidentifyFiles
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: deidentification.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: file_validation.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: launch_ec2.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): Created: builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: creating 'builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip' archive
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/cognito/lambda/logEmailDelivery
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): Created: builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip' archive
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creation complete after 0s [id=835070278144015041]
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/updateFiles
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): Created: builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip' archive
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/queryVCFsubmit
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] (local-exec): Created: builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip
module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0]: Creation complete after 0s [id=2675315068809810946]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creation complete after 0s [id=8264243345743567940]
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: creating 'builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip' archive
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/pluginGnomadConstraint
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (local-exec): Created: builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creation complete after 0s [id=2255895253697332253]
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: creating 'builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip' archive
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/error_catcher/lambda/notifyOnError
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): Created: builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creation complete after 0s [id=4683737684595968029]
module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0]: Creation complete after 0s [id=5530267156265449446]
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip' archive
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/concatStarter
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (local-exec): Created: builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: creating 'builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip' archive
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/clearTempAndRegions
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): Created: builds/00f3a633231c795f8dc9de3856cbb31a0fa1dfb41fb36584d88a666c2997e65a.zip
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creation complete after 1s [id=4797186934241155879]
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip' archive
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/batchStarter
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): Created: builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-batchStarter.null_resource.archive[0]: Creation complete after 1s [id=7804393296594834294]
module.svep[0].module.lambda-concatStarter.null_resource.archive[0]: Creation complete after 1s [id=1322434434046888873]
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): zip: creating 'builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip' archive
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/deleteClinicalWorkflow
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (local-exec): Created: builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: creating 'builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip' archive
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/pluginClinvar
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (local-exec): Created: builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip
module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0]: Creation complete after 1s [id=4990446000956852948]
module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0]: Creation complete after 1s [id=2030446890299180336]
module.webgui.terraform_data.cloudfront-version-invalidate: Destroying... [id=acd47004-9954-0393-fb07-b7a02732945b]
module.webgui.terraform_data.cloudfront-version-invalidate: Destruction complete after 0s
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: creating 'builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip' archive
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/queryGTF
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryGTF.null_resource.archive[0] (local-exec): Created: builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip
module.webgui.null_resource.s3-upload: Destroying... [id=995090316283018858]
module.webgui.null_resource.s3-upload: Destruction complete after 0s
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: creating 'builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip' archive
module.svep[0].module.lambda-queryGTF.null_resource.archive[0]: Creation complete after 1s [id=4097523593030430937]
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/pluginGnomad
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (local-exec): Created: builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/c36b6002136a7854703acbc9429139185c5c1865d831b1a6429ec678890776f2.zip' archive
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/sendJobEmail
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): Created: builds/c36b6002136a7854703acbc9429139185c5c1865d831b1a6429ec678890776f2.zip
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (deposed object 4eda8cbe): Destroying... [id=2741618623640032437]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Destruction complete after 0s
module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0]: Creation complete after 1s [id=205640325060837920]
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/0bc11a361954aaac54be05525f7b6b7d819b5c2de7890264e819c10fa037f29b.zip' archive
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/updateReferenceFiles
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.sh
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar_xmltobed.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: constraints.py
module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creation complete after 0s [id=2548439913444835077]
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: creating 'builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip' archive
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/createPages
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-createPages.null_resource.archive[0] (local-exec): Created: builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: ensembl.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: mirna.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: version_checks.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Created: builds/0bc11a361954aaac54be05525f7b6b7d819b5c2de7890264e819c10fa037f29b.zip
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creation complete after 1s [id=7773327475944407747]
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: creating 'builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip' archive
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/queryVCF
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-queryVCF.null_resource.archive[0] (local-exec): Created: builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: creating 'builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip' archive
module.svep[0].module.lambda-createPages.null_resource.archive[0]: Creation complete after 1s [id=3422793906948196548]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (deposed object 76a7133f): Destroying... [id=6982957059749669033]
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (deposed object bef14ffe): Destroying... [id=4581308003684818034]
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/concatPages
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-concatPages.null_resource.archive[0] (local-exec): Created: builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Destruction complete after 0s
module.svep[0].module.lambda-queryVCF.null_resource.archive[0]: Creation complete after 0s [id=8505047242348069607]
module.svep[0].module.lambda-concatPages.null_resource.archive[0]: Creation complete after 0s [id=4816171423725840729]
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Destruction complete after 0s
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (deposed object ca55ecc4): Destroying... [id=8752627037143596]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Destruction complete after 0s
module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this: Creating...
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creating...
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=dedc6ba9c9f5a7146f31cfb4a026d7986ad2c9f0]
module.svep[0].module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=0e7a47b3d37cac7028cbddd0816fab3415c44122]
module.sbeacon.module.lambda-generateReports.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-generateReports.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creating...
module.webgui.aws_s3_object.version: Modifying... [id=webgui-bucket-20250725041401948400000001/version.txt]
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.webgui.aws_s3_object.version: Modifications complete after 0s [id=webgui-bucket-20250725041401948400000001/version.txt]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): zip: creating 'builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip' archive
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): Installing python requirements: sbeacon/lambda/generateReports/requirements.txt
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-dyw24hod
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-dyw24hod
module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: creating 'builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip' archive
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/getAnalyses
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_filtering_terms.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id_g_variants.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): Created: builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): zip: creating 'builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip' archive
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/customMessageLambdaTrigger/requirements.txt
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-6j6mw6yj
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-6j6mw6yj
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip' archive
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/initQuery
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creation complete after 1s [id=2105472348233953384]
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-initQuery.null_resource.archive[0] (local-exec): Created: builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] (local-exec): zip: creating 'builds/12a7d26d1fa7f85cdd48ea1119e4d6463a8cd46e01831600db5b2431337cd75e.zip' archive
module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/pluginGnomadOneKG
module.svep[0].module.lambda-initQuery.null_resource.archive[0]: Creation complete after 1s [id=7265662668319997127]
module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] (local-exec): zip: adding: __pycache__/
module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] (local-exec): zip: adding: __pycache__/lambda_function.cpython-312.pyc
module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] (local-exec): Created: builds/12a7d26d1fa7f85cdd48ea1119e4d6463a8cd46e01831600db5b2431337cd75e.zip
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: creating 'builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip' archive
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/getRuns
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip' archive
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: creating 'builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip' archive
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/getFilteringTerms
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): Created: builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0]: Creation complete after 1s [id=6016066381977888741]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_filtering_terms.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_analyses.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_g_variants.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): Created: builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendRegistrationEmail/requirements.txt
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-ctu_3vg_
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-ctu_3vg_
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creation complete after 1s [id=4355470708223450220]
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creation complete after 1s [id=1589283979224708586]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creation complete after 0s [id=8e4996283ae4aa09dd7ec66f46f266fca37cc150]
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creating...
module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this: Creating...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: creating 'builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip' archive
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/qcNotes
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): Created: builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip
module.svep[0].module.lambda-qcNotes.null_resource.archive[0]: Creation complete after 0s [id=5150079328575095735]
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: creating 'builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip' archive
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/indexer
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: USER_GUIDE.md
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: ctas_queries.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_index.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_relations.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_terms.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): Created: builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: creating 'builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip' archive
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creation complete after 0s [id=4946746472317843384]
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/getBiosamples
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_filtering_terms.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_analyses.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_g_variants.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_runs.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): Created: builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip' archive
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/splitQuery
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): Created: builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creation complete after 0s [id=8466248233733719724]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creation complete after 0s [id=7886212830730332134]
module.svep[0].aws_lambda_layer_version.binaries_layer: Creating...
module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0]: Creation complete after 0s [id=3976c4ea45b453acffa4cd176f7eee5d34ac791e]
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this: Creation complete after 1s [id=sha256:57adbd6145804609511ef1a79926c2c0caa5863f38382a49b8d3f0be44fee74d307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers]
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: creating 'builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip' archive
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/getProjects
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/__init__.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/models.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): Created: builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: creating 'builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip' archive
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/getMap
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): Created: builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creation complete after 1s [id=5396264464649673642]
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creation complete after 1s [id=1825637001015694887]
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: creating 'builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip' archive
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/getIndividuals
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_filtering_terms.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_biosamples.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_g_variants.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): Created: builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creation complete after 1s [id=2356399476447977700]
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: creating 'builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip' archive
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/getGenomicVariants
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id_biosamples.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id_individuals.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): Created: builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: creating 'builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip' archive
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/sbeacon/lambda/getEntryTypes
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): Created: builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Creation complete after 0s [id=195102759186218056]
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creation complete after 0s [id=2363717432981406271]
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip' archive
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/248/default/svep/lambda/batchSubmit
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): Created: builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip
module.svep[0].module.lambda-batchSubmit.null_resource.archive[0]: Creation complete after 0s [id=2773534717164179587]
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip' archive
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendClinicJobEmail/requirements.txt
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creating
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.